:PROPERTIES:
:ID:       9D4EC4DC-FC1D-430D-B834-CB0916949915
:header-args: :results output :session langchain :async :var host_py="python3" :var venv="/tmp/langchain" :var venv_py="/tmp/langchain/bin/python" :python "/tmp/langchain/bin/python"
:END:
#+title: langchain

Langchain is a harness for model orchestration.
My setup typically involves using langchain directly with [[id:002B2928-C32F-49F3-B93F-CBEEE215A7D7][python]]
and local inference using [[id:D87B9E33-CA56-4301-A59A-6FC951966D08][ollama]].

* [[id:A3C4A953-79CA-4160-AB26-A6EDCCD8AC09][Setup the Environment]]

#+begin_src shell
  ${host_py} -m venv ${venv}
  ${venv_py} -m pip install langchain-ollama
#+end_src

#+RESULTS:
| Collecting   | langchain-ollama                |                                                                                                          |                                                                                                             |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_ollama-1.1.0-py3-none-any.whl.metadata                                                         | (3.0                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | langchain-core<2.0.0,>=1.2.21   | (from                                                                                                    | langchain-ollama)                                                                                           |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_core-1.4.7-py3-none-any.whl.metadata                                                           | (4.5                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | ollama<1.0.0,>=0.6.1            | (from                                                                                                    | langchain-ollama)                                                                                           |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | ollama-0.6.2-py3-none-any.whl.metadata                                                                   | (5.8                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | jsonpatch<2.0.0,>=1.33.0        | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | jsonpatch-1.33-py2.py3-none-any.whl.metadata                                                             | (3.0                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | langchain-protocol>=0.0.14      | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_protocol-0.0.17-py3-none-any.whl.metadata                                                      | (2.4                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | langsmith<1.0.0,>=0.3.45        | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langsmith-0.8.15-py3-none-any.whl.metadata                                                               | (17                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | packaging>=23.2.0               | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | packaging-26.2-py3-none-any.whl.metadata                                                                 | (3.5                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | pydantic<3.0.0,>=2.7.4          | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pydantic-2.13.4-py3-none-any.whl.metadata                                                                | (109                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | pyyaml<7.0.0,>=5.3.0            | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pyyaml-6.0.3-cp314-cp314-macosx_11_0_arm64.whl.metadata                                                  | (2.4                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | tenacity!=8.4.0,<10.0.0,>=8.1.0 | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | tenacity-9.1.4-py3-none-any.whl.metadata                                                                 | (1.2                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | typing-extensions<5.0.0,>=4.7.0 | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | typing_extensions-4.15.0-py3-none-any.whl.metadata                                                       | (3.3                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | uuid-utils<1.0,>=0.12.0         | (from                                                                                                    | langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                                            |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | uuid_utils-0.16.0-cp314-cp314-macosx_10_12_x86_64.macosx_11_0_arm64.macosx_10_12_universal2.whl.metadata | (6.4                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | jsonpointer>=1.9                | (from                                                                                                    | jsonpatch<2.0.0,>=1.33.0->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | jsonpointer-3.1.1-py3-none-any.whl.metadata                                                              | (2.4                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | httpx<1,>=0.23.0                | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | httpx-0.28.1-py3-none-any.whl.metadata                                                                   | (7.1                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | orjson>=3.9.14                  | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | orjson-3.11.9-cp314-cp314-macosx_15_0_arm64.whl.metadata                                                 | (41                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | requests-toolbelt>=1.0.0        | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | requests_toolbelt-1.0.0-py2.py3-none-any.whl.metadata                                                    | (14                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | requests>=2.0.0                 | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | requests-2.34.2-py3-none-any.whl.metadata                                                                | (4.8                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | websockets>=15.0                | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | websockets-16.0-cp314-cp314-macosx_11_0_arm64.whl.metadata                                               | (6.8                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | xxhash>=3.0.0                   | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | xxhash-3.7.0-cp314-cp314-macosx_11_0_arm64.whl.metadata                                                  | (13                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | zstandard>=0.23.0               | (from                                                                                                    | langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                  |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | zstandard-0.25.0-cp314-cp314-macosx_11_0_arm64.whl.metadata                                              | (3.3                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | anyio                           | (from                                                                                                    | httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | anyio-4.13.0-py3-none-any.whl.metadata                                                                   | (4.5                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | certifi                         | (from                                                                                                    | httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | certifi-2026.5.20-py3-none-any.whl.metadata                                                              | (2.5                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | httpcore==1.*                   | (from                                                                                                    | httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | httpcore-1.0.9-py3-none-any.whl.metadata                                                                 | (21                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | idna                            | (from                                                                                                    | httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | idna-3.18-py3-none-any.whl.metadata                                                                      | (6.1                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | h11>=0.16                       | (from                                                                                                    | httpcore==1.*->httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | h11-0.16.0-py3-none-any.whl.metadata                                                                     | (8.3                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | annotated-types>=0.6.0          | (from                                                                                                    | pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                    |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | annotated_types-0.7.0-py3-none-any.whl.metadata                                                          | (15                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | pydantic-core==2.46.4           | (from                                                                                                    | pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                    |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pydantic_core-2.46.4-cp314-cp314-macosx_11_0_arm64.whl.metadata                                          | (6.6                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | typing-inspection>=0.4.2        | (from                                                                                                    | pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                                    |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | typing_inspection-0.4.2-py3-none-any.whl.metadata                                                        | (2.6                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | charset_normalizer<4,>=2        | (from                                                                                                    | requests>=2.0.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                 |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | charset_normalizer-3.4.7-cp314-cp314-macosx_10_15_universal2.whl.metadata                                | (40                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Collecting   | urllib3<3,>=1.26                | (from                                                                                                    | requests>=2.0.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama)                 |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | urllib3-2.7.0-py3-none-any.whl.metadata                                                                  | (6.9                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_ollama-1.1.0-py3-none-any.whl                                                                  | (31                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_core-1.4.7-py3-none-any.whl                                                                    | (554                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | jsonpatch-1.33-py2.py3-none-any.whl                                                                      | (12                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langsmith-0.8.15-py3-none-any.whl                                                                        | (498                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | httpx-0.28.1-py3-none-any.whl                                                                            | (73                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | httpcore-1.0.9-py3-none-any.whl                                                                          | (78                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | ollama-0.6.2-py3-none-any.whl                                                                            | (15                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pydantic-2.13.4-py3-none-any.whl                                                                         | (472                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pydantic_core-2.46.4-cp314-cp314-macosx_11_0_arm64.whl                                                   | (2.0                                                                                                        | MB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | pyyaml-6.0.3-cp314-cp314-macosx_11_0_arm64.whl                                                           | (173                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | tenacity-9.1.4-py3-none-any.whl                                                                          | (28                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | typing_extensions-4.15.0-py3-none-any.whl                                                                | (44                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | uuid_utils-0.16.0-cp314-cp314-macosx_10_12_x86_64.macosx_11_0_arm64.macosx_10_12_universal2.whl          | (564                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | annotated_types-0.7.0-py3-none-any.whl                                                                   | (13                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | h11-0.16.0-py3-none-any.whl                                                                              | (37                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | jsonpointer-3.1.1-py3-none-any.whl                                                                       | (7.7                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | langchain_protocol-0.0.17-py3-none-any.whl                                                               | (7.1                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | orjson-3.11.9-cp314-cp314-macosx_15_0_arm64.whl                                                          | (128                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | packaging-26.2-py3-none-any.whl                                                                          | (100                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | requests-2.34.2-py3-none-any.whl                                                                         | (73                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | charset_normalizer-3.4.7-cp314-cp314-macosx_10_15_universal2.whl                                         | (309                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | idna-3.18-py3-none-any.whl                                                                               | (65                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | urllib3-2.7.0-py3-none-any.whl                                                                           | (131                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | certifi-2026.5.20-py3-none-any.whl                                                                       | (134                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | requests_toolbelt-1.0.0-py2.py3-none-any.whl                                                             | (54                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | typing_inspection-0.4.2-py3-none-any.whl                                                                 | (14                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | websockets-16.0-cp314-cp314-macosx_11_0_arm64.whl                                                        | (175                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | xxhash-3.7.0-cp314-cp314-macosx_11_0_arm64.whl                                                           | (30                                                                                                         | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | zstandard-0.25.0-cp314-cp314-macosx_11_0_arm64.whl                                                       | (640                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Using        | cached                          | anyio-4.13.0-py3-none-any.whl                                                                            | (114                                                                                                        | kB)               |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Installing   | collected                       | packages:                                                                                                | zstandard,                                                                                                  | xxhash,           | websockets,              | uuid-utils, | urllib3,       | typing-extensions, | tenacity, | pyyaml,        | packaging,        | orjson,              | jsonpointer,           | idna,                     | h11,             | charset_normalizer, | certifi,      | annotated-types, | typing-inspection, | requests,            | pydantic-core, | langchain-protocol, | jsonpatch,              | httpcore,      | anyio,                   | requests-toolbelt,      | pydantic,     | httpx,            | ollama,         | langsmith,   | langchain-core,  | langchain-ollama |
|              |                                 |                                                                                                          |                                                                                                             |                   |                          |             |                |                    |           |                |                   |                      |                        |                           |                  |                     |               |                  |                    |                      |                |                     |                         |                |                          |                         |               |                   |                 |              |                  |                  |
| Successfully | installed                       | annotated-types-0.7.0                                                                                    | anyio-4.13.0                                                                                                | certifi-2026.5.20 | charset_normalizer-3.4.7 | h11-0.16.0  | httpcore-1.0.9 | httpx-0.28.1       | idna-3.18 | jsonpatch-1.33 | jsonpointer-3.1.1 | langchain-core-1.4.7 | langchain-ollama-1.1.0 | langchain-protocol-0.0.17 | langsmith-0.8.15 | ollama-0.6.2        | orjson-3.11.9 | packaging-26.2   | pydantic-2.13.4    | pydantic-core-2.46.4 | pyyaml-6.0.3   | requests-2.34.2     | requests-toolbelt-1.0.0 | tenacity-9.1.4 | typing-extensions-4.15.0 | typing-inspection-0.4.2 | urllib3-2.7.0 | uuid-utils-0.16.0 | websockets-16.0 | xxhash-3.7.0 | zstandard-0.25.0 |                  |

* Using Ollama

Ollama can be used from the provided library.

#+begin_src python
  from langchain_ollama.llms import OllamaLLM
  from langchain_core.messages import HumanMessage

  print(OllamaLLM(model="gpt-oss").invoke([HumanMessage("Howdy!")]))
#+end_src

#+RESULTS:
: Howdy! How can I help you today?

